Revit 2027 API
ElectricalSystem.GetCircuitPath Method
 Gets the list of the electrical system circuit path node position.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetCircuitPath()
Public Function GetCircuitPath As IList(Of XYZ)
public:
IList<XYZ^>^ GetCircuitPath()
member GetCircuitPath : unit -> IList<XYZ>
Return Value
IList<XYZ>
 The list of the electrical system circuit path node position.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace